In [ ]:
import numpy as np
import pandas as pn

In [ ]:
path=r'Visadataset - Visadataset'
path_df=pd.read_csv(path)
path_df

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
path=r'Visadataset - Visadataset.csv'
visa_df=pd.read_csv(path)
visa_df.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

In [6]:
dict1={'Name':['A','B','C','D'],
      'Num':[1,2,3,4]}
d=pd.DataFrame(dict1)
d

  Name  Num
0    A    1
1    B    2
2    C    3
3    D    4

In [8]:
l=np.where(d['Num']>2,100,d['Num'])

d['num']=l
d

  Name  Num  num
0    A    1    1
1    B    2    2
2    C    3  100
3    D    4  100

In [14]:
l=[]
for i in d1['Num']:
    if i>2:
        i.append(100),
    else i2:
        i.append(i),
dict1=l
d1

SyntaxError: expected ':' (3467011653.py, line 5)